In [2]:
import pandas as pd
pd.set_option('display.max_columns', None)
import numpy as np 
import matplotlib.pyplot as plt 
import math
from sklearn.model_selection import train_test_split 
from sklearn.impute import SimpleImputer
import warnings 
warnings.filterwarnings("ignore")
import acquire
import seaborn as sns 
import pydataset
import os

### Data Acquisition

1. Import the iris data from the 'iris' dataset and complete the following: 
- Print the first three rows 
- Print the number of rows and columns 
- Print the column names 
- Print the data type of each column 
- Print the summary statistics for each of the numeric variables

In [3]:
df_iris = pydataset.data('iris')

In [5]:
df_iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [6]:
df_iris.shape

(150, 5)

In [7]:
df_iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [8]:
df_iris.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

In [9]:
df_iris.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

2. Read the Table1_custdetails table from your spreadsheet exercises google sheet into a dataframe named df_google_sheets. Using the read, do the following:
- Assign the first 100 rows to a new DataFrame, df_google_sheets_sample 
- Print the number of rows of your original DataFrame
- Print the column names that have a data type of object 
- Compute the range for each of the numeric variables

In [18]:
#Must copy link directly and not use 'copy this link' under 'share'
sheet_url = 'https://docs.google.com/spreadsheets/d/1sJY2Z2in2iCaogQO0F7XKP2Ti7bio12AHDZgD7Xw_6A/edit#gid=1023018493'
export_sheet_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')
df_google_sheet = pd.read_csv(export_sheet_url)

In [17]:
df_google_sheets_sample = df_google_sheet.head(100)

In [ ]:
df_google_sheet.shape

In [ ]:
df_google_sheet.select_dtypes(include='object').columns

In [20]:
df_google_sheet.describe().loc['max'] - df_google_sheet.describe().loc['min']

3. Download your spreadsheet exercises google sheet as an excel file. Read the Table1_Custdetails worksheet into a datframe named df_excel.
- Assign the first 100 rows to a new dataframe, df_excel_sample
- Print the number of rows of your original dataframe 
- Print the first 5 column names 
- Print the column names that have a data type of object 
- Compute the range for each of the numeric variables

In [21]:
df_excel = pd.read_excel('Custdetails (1).xlsx')

In [ ]:
df_excel_sample = df_excel.head(100)

In [ ]:
df_excel.shape

In [ ]:
df_excel.columns[:5]

In [ ]:
df_excel.dtypes[df_excel.dtypes=='object']

In [25]:
stats_excel = df_excel.describe().T
stats_excel['range'] = stats_excel['max'] - stats_excel['min']
stats_excel['range']

4. Read the data from this google sheet into a dataframe, df_google
- Print the first three rows 
- Print the number of rows and columns 
- Print the column names 
- Print the data type of each column 
- Print the summary statistics for each of the numeric variables 
- Print the unique values for each of your categorical variables

In [ ]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'
export_sheet_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')
df_google = pd.read_csv(export_sheet_url)
df_google

In [ ]:
df_google.shape

In [ ]:
df_google.columns

In [ ]:
df_google.dtypes

In [ ]:
df_google.describe()

In [ ]:
df_google[['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']].nunique()

In [ ]:
df_google.select_dtypes('object')

### Data Preparation

1. Iris Data

In [16]:
iris_df = acquire.get_iris_data()

Acquiring data from SQL database

In [17]:
iris_df.head(2)

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,2,4.9,3.0,1.4,0.2,setosa

In [18]:
iris_df.columns

Index(['species_id', 'measurement_id', 'sepal_length', 'sepal_width',
       'petal_length', 'petal_width', 'species_name'],
      dtype='object')

In [19]:
#Drop the species_id and measurement_id columns 
#dataframe.drop_paranthesis_columnsequals_brackets_'columnName'_comma_implace=true_closed parenthesis
iris_df.drop(columns=['species_id'], inplace=True)
iris_df.head()

,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,1,5.1,3.5,1.4,0.2,setosa
1,2,4.9,3.0,1.4,0.2,setosa
2,3,4.7,3.2,1.3,0.2,setosa
3,4,4.6,3.1,1.5,0.2,setosa
4,5,5.0,3.6,1.4,0.2,setosa

In [20]:
#drop the measurement_id column 
iris_df.drop(columns=['measurement_id'], inplace=True)
iris_df.head()

   sepal_length  sepal_width  petal_length  petal_width species_name
0           5.1          3.5           1.4          0.2       setosa
1           4.9          3.0           1.4          0.2       setosa
2           4.7          3.2           1.3          0.2       setosa
3           4.6          3.1           1.5          0.2       setosa
4           5.0          3.6           1.4          0.2       setosa

In [21]:
#rename the species_name column just species 
iris_df.rename(columns={'species_name': 'species'}, inplace=True)
iris_df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [22]:
#Create dummy variables of the species name 
dummy_iris = pd.get_dummies(iris_df[['species']], dummy_na=False, drop_first=True)
dummy_iris.head()

   species_versicolor  species_virginica
0                   0                  0
1                   0                  0
2                   0                  0
3                   0                  0
4                   0                  0

In [24]:
#concatenate onto the iris dataframe. 
iris_df = pd.concat([iris_df, dummy_iris], axis=1)
iris_df.head()

,sepal_length,sepal_width,petal_length,petal_width,species,species_versicolor,species_virginica,species_versicolor,species_virginica
0,5.1,3.5,1.4,0.2,setosa,0,0,0,0
1,4.9,3.0,1.4,0.2,setosa,0,0,0,0
2,4.7,3.2,1.3,0.2,setosa,0,0,0,0
3,4.6,3.1,1.5,0.2,setosa,0,0,0,0
4,5.0,3.6,1.4,0.2,setosa,0,0,0,0

In [25]:
#Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied. 
def prep_iris(iris_df):
    iris_df.drop(columns=['species_id'], inplace=True)
    iris_df.drop(columns=['measurement_id'], inplace=True)
    iris_df.rename(columns={'species_name':'species'}, inplace=True)
    dummy_iris = pd.get_dummies(iris_df[['species']], dummy_na=False, drop_first=[True])
    iris_df = pd.concat([iris_df, dummy_iris], axis=1)
    return iris_df

### Titanic Data Cleaning

In [41]:
titanic_df = acquire.get_titanic_data()

Using cached csv

In [42]:
#drop any unnecessary, unhelpful, or duplicated columns 
titanic_df.columns

Index(['passenger_id', 'survived', 'pclass', 'sex', 'age', 'sibsp', 'parch',
       'fare', 'embarked', 'class', 'deck', 'embark_town', 'alone'],
      dtype='object')

In [43]:
titanic_df.drop(columns=['deck', 'passenger_id', 'embarked', 'pclass'], inplace=True)
titanic_df.head(3)

   survived     sex   age  sibsp  parch     fare  class  embark_town  alone
0         0    male  22.0      1      0   7.2500  Third  Southampton      0
1         1  female  38.0      1      0  71.2833  First    Cherbourg      0
2         1  female  26.0      0      0   7.9250  Third  Southampton      1

In [44]:
titanic_df.embark_town.value_counts()

Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

In [45]:
#fill the 2 null in embark_town with 'Southhampton'
titanic_df['embark_town'] = titanic_df.embark_town.fillna(value="Southampton")

In [46]:
#fill with zeroes 
titanic_df['age'] = titanic_df.age.fillna(0)

In [52]:
#Encode categorical columns 
dummy_df = pd.get_dummies(titanic_df[['sex', 'embark_town']], dummy_na = False, drop_first = [True, True])
titanic_df = pd.concat([titanic_df, dummy_df], axis = 1)
titanic_df.head()

,survived,sex,age,sibsp,parch,fare,class,embark_town,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
0,0,male,22.0,1,0,7.2500,Third,Southampton,0,1,0,1
1,1,female,38.0,1,0,71.2833,First,Cherbourg,0,0,0,0
2,1,female,26.0,0,0,7.9250,Third,Southampton,1,0,0,1
3,1,female,35.0,1,0,53.1000,First,Southampton,0,0,0,1
4,0,male,35.0,0,0,8.0500,Third,Southampton,1,1,0,1

Create a function to clean titanic data

In [54]:
def clean_titanic_data(df):
    df = df.drop_duplicates()
    cols_to_drop = ['deck', 'embarked', 'class', 'passenger_id']
    df = df.drop(columns=cols_to_drop)
    df['embark_town'] = df.embark_town.fillna(value='Southampton')
    dummy_df = pd.get_dummies(df[['sex', 'embark_town']], dummy_na=False, drop_first=[True, True])
    df = pd.concat([df, dummy_df], axis=1)
    
    return df

# Telco Data

In [57]:
telco_df = acquire.get_telco_data()

Using cached csv

In [58]:
telco_df.head()

,payment_type_id,contract_type_id,internet_service_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,device_protection,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,internet_service_type,contract_type,payment_type
0,2,2,1,0002-ORFBO,Female,0,Yes,Yes,9,Yes,No,No,Yes,No,Yes,Yes,No,Yes,65.6,593.3,No,DSL,One year,Mailed check
1,2,1,1,0003-MKNFE,Male,0,No,No,9,Yes,Yes,No,No,No,No,No,Yes,No,59.9,542.4,No,DSL,Month-to-month,Mailed check
2,1,1,2,0004-TLHLJ,Male,0,No,No,4,Yes,No,No,No,Yes,No,No,No,Yes,73.9,280.85,Yes,Fiber optic,Month-to-month,Electronic check
3,1,1,2,0011-IGKFF,Male,1,Yes,No,13,Yes,No,No,Yes,Yes,No,Yes,Yes,Yes,98.0,1237.85,Yes,Fiber optic,Month-to-month,Electronic check
4,2,1,2,0013-EXCHZ,Female,1,Yes,No,3,Yes,No,No,No,No,Yes,Yes,No,Yes,83.9,267.4,Yes,Fiber optic,Month-to-month,Mailed check

In [60]:
#drop any unnecessary, unhelpful, or duplicated columns 
telco_df.columns

Index(['payment_type_id', 'contract_type_id', 'internet_service_type_id',
       'customer_id', 'gender', 'senior_citizen', 'partner', 'dependents',
       'tenure', 'phone_service', 'multiple_lines', 'online_security',
       'online_backup', 'device_protection', 'tech_support', 'streaming_tv',
       'streaming_movies', 'paperless_billing', 'monthly_charges',
       'total_charges', 'churn', 'internet_service_type', 'contract_type',
       'payment_type'],
      dtype='object')

In [62]:
telco_df.drop(columns=['payment_type_id', 'internet_service_type_id', 'contract_type_id', 'customer_id'], inplace=True)

In [ ]:
#Drop null values
df['total_charges'] = df['total_charges'].str.strip()
    df = df[df.total_charges != '']

In [ ]:
#change datatype 
df['total_charges'] = df.total_charges.astype(float)

In [ ]:
#Convert binary categorical variables to numeric 
df['gender_encoded'] = df.gender.map({'Female': 1, 'Male': 0})
    df['partner_encoded'] = df.partner.map({'Yes': 1, 'No': 0})
    df['dependents_encoded'] = df.dependents.map({'Yes': 1, 'No': 0})
    df['phone_service_encoded'] = df.phone_service.map({'Yes': 1, 'No': 0})
    df['paperless_billing_encoded'] = df.paperless_billing.map({'Yes': 1, 'No': 0})
    df['churn_encoded'] = df.churn.map({'Yes': 1, 'No': 0})

In [ ]:
#Get dummies for non-binary categorical variables 
dummy_df = pd.get_dummies(df[['multiple_lines', \
                              'online_security', \
                              'online_backup', \
                              'device_protection', \
                              'tech_support', \
                              'streaming_tv', \
                              'streaming_movies', \
                              'contract_type', \
                              'internet_service_type', \
                              'payment_type']], dummy_na=False, \
                              drop_first=True)

In [ ]:
#Concatenate dummy dataframe to original 
df = pd.concat([df, dummy_df], axis=1)

In [ ]:
#split data 
train, validate, test = split_telco_data(df)

In [ ]:
#Telco Data Function 
def prep_telco_data(df):
    # Drop duplicate columns
    df.drop(columns=['payment_type_id', 'internet_service_type_id', 'contract_type_id', 'customer_id'], inplace=True)
       
    # Drop null values stored as whitespace    
    df['total_charges'] = df['total_charges'].str.strip()
    df = df[df.total_charges != '']
    
    # Convert to correct datatype
    df['total_charges'] = df.total_charges.astype(float)
    
    # Convert binary categorical variables to numeric
    df['gender_encoded'] = df.gender.map({'Female': 1, 'Male': 0})
    df['partner_encoded'] = df.partner.map({'Yes': 1, 'No': 0})
    df['dependents_encoded'] = df.dependents.map({'Yes': 1, 'No': 0})
    df['phone_service_encoded'] = df.phone_service.map({'Yes': 1, 'No': 0})
    df['paperless_billing_encoded'] = df.paperless_billing.map({'Yes': 1, 'No': 0})
    df['churn_encoded'] = df.churn.map({'Yes': 1, 'No': 0})
    
    # Get dummies for non-binary categorical variables
    dummy_df = pd.get_dummies(df[['multiple_lines', \
                              'online_security', \
                              'online_backup', \
                              'device_protection', \
                              'tech_support', \
                              'streaming_tv', \
                              'streaming_movies', \
                              'contract_type', \
                              'internet_service_type', \
                              'payment_type']], dummy_na=False, \
                              drop_first=True)
    
    # Concatenate dummy dataframe to original 
    df = pd.concat([df, dummy_df], axis=1)
    
    # split the data
    train, validate, test = split_telco_data(df)
    
    return train, validate, test